HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSent_bf.h
/** \\brief  Offset for Ifx_SENT_ID_Bits.MODREV */
#define IFX_SENT_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_SENT_ID_Bits.MODTYPE */
#define IFX_SENT_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_SENT_ID_Bits.MODTYPE */
#define IFX_SENT_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_SENT_ID_Bits.MODTYPE */
#define IFX_SENT_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC0 */
#define IFX_SENT_INTOV_IPC0_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC0 */
#define IFX_SENT_INTOV_IPC0_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC0 */
#define IFX_SENT_INTOV_IPC0_OFF (0)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC10 */
#define IFX_SENT_INTOV_IPC10_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC10 */
#define IFX_SENT_INTOV_IPC10_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC10 */
#define IFX_SENT_INTOV_IPC10_OFF (10)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC11 */
#define IFX_SENT_INTOV_IPC11_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC11 */
#define IFX_SENT_INTOV_IPC11_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC11 */
#define IFX_SENT_INTOV_IPC11_OFF (11)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC12 */
#define IFX_SENT_INTOV_IPC12_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC12 */
#define IFX_SENT_INTOV_IPC12_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC12 */
#define IFX_SENT_INTOV_IPC12_OFF (12)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC13 */
#define IFX_SENT_INTOV_IPC13_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC13 */
#define IFX_SENT_INTOV_IPC13_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC13 */
#define IFX_SENT_INTOV_IPC13_OFF (13)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC14 */
#define IFX_SENT_INTOV_IPC14_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC14 */
#define IFX_SENT_INTOV_IPC14_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC14 */
#define IFX_SENT_INTOV_IPC14_OFF (14)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC1 */
#define IFX_SENT_INTOV_IPC1_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC1 */
#define IFX_SENT_INTOV_IPC1_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC1 */
#define IFX_SENT_INTOV_IPC1_OFF (1)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC2 */
#define IFX_SENT_INTOV_IPC2_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC2 */
#define IFX_SENT_INTOV_IPC2_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC2 */
#define IFX_SENT_INTOV_IPC2_OFF (2)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC3 */
#define IFX_SENT_INTOV_IPC3_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC3 */
#define IFX_SENT_INTOV_IPC3_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC3 */
#define IFX_SENT_INTOV_IPC3_OFF (3)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC4 */
#define IFX_SENT_INTOV_IPC4_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC4 */
#define IFX_SENT_INTOV_IPC4_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC4 */
#define IFX_SENT_INTOV_IPC4_OFF (4)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC5 */
#define IFX_SENT_INTOV_IPC5_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC5 */
#define IFX_SENT_INTOV_IPC5_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC5 */
#define IFX_SENT_INTOV_IPC5_OFF (5)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC6 */
#define IFX_SENT_INTOV_IPC6_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC6 */
#define IFX_SENT_INTOV_IPC6_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC6 */
#define IFX_SENT_INTOV_IPC6_OFF (6)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC7 */
#define IFX_SENT_INTOV_IPC7_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC7 */
#define IFX_SENT_INTOV_IPC7_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC7 */
#define IFX_SENT_INTOV_IPC7_OFF (7)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC8 */
#define IFX_SENT_INTOV_IPC8_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC8 */
#define IFX_SENT_INTOV_IPC8_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC8 */
#define IFX_SENT_INTOV_IPC8_OFF (8)

/** \\brief  Length for Ifx_SENT_INTOV_Bits.IPC9 */
#define IFX_SENT_INTOV_IPC9_LEN (1)

/** \\brief  Mask for Ifx_SENT_INTOV_Bits.IPC9 */
#define IFX_SENT_INTOV_IPC9_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_INTOV_Bits.IPC9 */
#define IFX_SENT_INTOV_IPC9_OFF (9)

/** \\brief  Length for Ifx_SENT_KRST0_Bits.RST */
#define IFX_SENT_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_SENT_KRST0_Bits.RST */
#define IFX_SENT_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_KRST0_Bits.RST */
#define IFX_SENT_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_SENT_KRST0_Bits.RSTSTAT */
#define IFX_SENT_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_SENT_KRST0_Bits.RSTSTAT */
#define IFX_SENT_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_KRST0_Bits.RSTSTAT */
#define IFX_SENT_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_SENT_KRST1_Bits.RST */
#define IFX_SENT_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_SENT_KRST1_Bits.RST */
#define IFX_SENT_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_KRST1_Bits.RST */
#define IFX_SENT_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_SENT_KRSTCLR_Bits.CLR */
#define IFX_SENT_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_SENT_KRSTCLR_Bits.CLR */
#define IFX_SENT_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_KRSTCLR_Bits.CLR */
#define IFX_SENT_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_SENT_OCS_Bits.SUS */
#define IFX_SENT_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_SENT_OCS_Bits.SUS */
#define IFX_SENT_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_SENT_OCS_Bits.SUS */
#define IFX_SENT_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_SENT_OCS_Bits.SUS_P */
#define IFX_SENT_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_SENT_OCS_Bits.SUS_P */
#define IFX_SENT_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_OCS_Bits.SUS_P */
#define IFX_SENT_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_SENT_OCS_Bits.SUSSTA */
#define IFX_SENT_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_SENT_OCS_Bits.SUSSTA */
#define IFX_SENT_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_OCS_Bits.SUSSTA */
#define IFX_SENT_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_SENT_RDR_Bits.RD0 */
#define IFX_SENT_RDR_RD0_LEN (4)

/** \\brief  Mask for Ifx_SENT_RDR_Bits.RD0 */
#define IFX_SENT_RDR_RD0_MSK (0xf)

/** \\brief  Offset for Ifx_SENT_RDR_Bits.RD0 */
#define IFX_SENT_RDR_RD0_OFF (0)

/** \\brief  Length for Ifx_SENT_RDR_Bits.RD1 */
#define IFX_SENT_RDR_RD1_LEN (4)

