HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSent_bf.h
/** \\brief  Mask for Ifx_SENT_RDR_Bits.RD1 */
#define IFX_SENT_RDR_RD1_MSK (0xf)

/** \\brief  Offset for Ifx_SENT_RDR_Bits.RD1 */
#define IFX_SENT_RDR_RD1_OFF (4)

/** \\brief  Length for Ifx_SENT_RDR_Bits.RD2 */
#define IFX_SENT_RDR_RD2_LEN (4)

/** \\brief  Mask for Ifx_SENT_RDR_Bits.RD2 */
#define IFX_SENT_RDR_RD2_MSK (0xf)

/** \\brief  Offset for Ifx_SENT_RDR_Bits.RD2 */
#define IFX_SENT_RDR_RD2_OFF (8)

/** \\brief  Length for Ifx_SENT_RDR_Bits.RD3 */
#define IFX_SENT_RDR_RD3_LEN (4)

/** \\brief  Mask for Ifx_SENT_RDR_Bits.RD3 */
#define IFX_SENT_RDR_RD3_MSK (0xf)

/** \\brief  Offset for Ifx_SENT_RDR_Bits.RD3 */
#define IFX_SENT_RDR_RD3_OFF (12)

/** \\brief  Length for Ifx_SENT_RDR_Bits.RD4 */
#define IFX_SENT_RDR_RD4_LEN (4)

/** \\brief  Mask for Ifx_SENT_RDR_Bits.RD4 */
#define IFX_SENT_RDR_RD4_MSK (0xf)

/** \\brief  Offset for Ifx_SENT_RDR_Bits.RD4 */
#define IFX_SENT_RDR_RD4_OFF (16)

/** \\brief  Length for Ifx_SENT_RDR_Bits.RD5 */
#define IFX_SENT_RDR_RD5_LEN (4)

/** \\brief  Mask for Ifx_SENT_RDR_Bits.RD5 */
#define IFX_SENT_RDR_RD5_MSK (0xf)

/** \\brief  Offset for Ifx_SENT_RDR_Bits.RD5 */
#define IFX_SENT_RDR_RD5_OFF (20)

/** \\brief  Length for Ifx_SENT_RDR_Bits.RD6 */
#define IFX_SENT_RDR_RD6_LEN (4)

/** \\brief  Mask for Ifx_SENT_RDR_Bits.RD6 */
#define IFX_SENT_RDR_RD6_MSK (0xf)

/** \\brief  Offset for Ifx_SENT_RDR_Bits.RD6 */
#define IFX_SENT_RDR_RD6_OFF (24)

/** \\brief  Length for Ifx_SENT_RDR_Bits.RD7 */
#define IFX_SENT_RDR_RD7_LEN (4)

/** \\brief  Mask for Ifx_SENT_RDR_Bits.RD7 */
#define IFX_SENT_RDR_RD7_MSK (0xf)

/** \\brief  Offset for Ifx_SENT_RDR_Bits.RD7 */
#define IFX_SENT_RDR_RD7_OFF (28)

/** \\brief  Length for Ifx_SENT_RTS_Bits.LTS */
#define IFX_SENT_RTS_LTS_LEN (32)

/** \\brief  Mask for Ifx_SENT_RTS_Bits.LTS */
#define IFX_SENT_RTS_LTS_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SENT_RTS_Bits.LTS */
#define IFX_SENT_RTS_LTS_OFF (0)

/** \\brief  Length for Ifx_SENT_TPD_Bits.TDIV */
#define IFX_SENT_TPD_TDIV_LEN (20)

/** \\brief  Mask for Ifx_SENT_TPD_Bits.TDIV */
#define IFX_SENT_TPD_TDIV_MSK (0xfffff)

/** \\brief  Offset for Ifx_SENT_TPD_Bits.TDIV */
#define IFX_SENT_TPD_TDIV_OFF (0)

/** \\brief  Length for Ifx_SENT_TSR_Bits.CTS */
#define IFX_SENT_TSR_CTS_LEN (32)

/** \\brief  Mask for Ifx_SENT_TSR_Bits.CTS */
#define IFX_SENT_TSR_CTS_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SENT_TSR_Bits.CTS */
#define IFX_SENT_TSR_CTS_OFF (0)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSENT_BF_H */
